title: App installed from untrusted source
id: androdr-010
status: production
description: App was not installed via a trusted app store.
author: AndroDR
date: 2026/03/27
tags:
    - attack.t1476
logsource:
    product: androdr
    service: app_scanner
detection:
    selection:
        is_system_app: false
        from_trusted_store: false
        is_known_oem_app: false
    condition: selection
level: medium
remediation:
    - "This app was not installed from a trusted app store. Verify you intended to install it."
