title: Package name matches threat database
id: androdr-001
status: production
description: Package name found in known-bad package IOC database.
author: AndroDR
date: 2026/03/27
tags:
    - attack.t1418
logsource:
    product: androdr
    service: app_scanner
detection:
    selection:
        package_name|ioc_lookup: package_ioc_db
    condition: selection
level: critical
remediation:
    - "Uninstall this app immediately."
